rtzaudio/STC1200_TivaTM4C1294NCPDT/LocateTask.c
    if (index <= MAX_CUE_POINTS)
    {
        uint32_t key = Hwi_disable();

        if (ipos)
            *ipos = g_sysData.cuePoint[index].ipos;

        flags = g_sysData.cuePoint[index].flags;

        Hwi_restore(key);
    }

    Semaphore_post(g_semaCue);

    return flags;
}

/*****************************************************************************
 * Return the tape time from the cue point absolute position.
 *****************************************************************************/

void CuePointGetTime(size_t index, TAPETIME* tapeTime)
{
    memset(tapeTime, 0, sizeof(TAPETIME));

    if (index <= MAX_CUE_POINTS)
    {
        int cuePosition = g_sysData.cuePoint[index].ipos;
        PositionGetTime(cuePosition, tapeTime);
        tapeTime->flags = (cuePosition < 0) ? 0 : F_PLUS;
    }
}

//*****************************************************************************
// Cue up a locate request to the locator. The cue point index is specified
// in param1. Cue point 65 is single point for cue/search buttons on machine.
//*****************************************************************************

Bool LocateSearch(size_t cuePointIndex)
{
    LocateMessage msgLocate;

    if (cuePointIndex > LAST_CUE_POINT)
        return FALSE;

    /* Make sure the memory location has a cue point stored */
    if (!(g_sysData.cuePoint[cuePointIndex].flags & CF_SET))
        return FALSE;

    msgLocate.command = LOCATE_SEARCH;
    msgLocate.param1  = (uint32_t)cuePointIndex;
    msgLocate.param2  = 0;

    return Mailbox_post(g_mailboxLocate, &msgLocate, 1000);
}

Bool LocateCancel(void)
{
    LocateMessage msgLocate;

    msgLocate.command = LOCATE_CANCEL;
    msgLocate.param1  = 0;
    msgLocate.param2  = 0;

    return Mailbox_post(g_mailboxLocate, &msgLocate, 1000);
}

void LocateAbort(void)
{
    g_sysData.searchCancel = TRUE;
}

bool LocateIsSearching(void)
{
    return g_sysData.searching;
}

bool IsTransportHaltMode()
{
    /* Abort if transport halted, must be tape out? */
    if ((g_sysData.transportMode & MODE_MASK) == MODE_HALT)
        return TRUE;

    return FALSE;
}

//*****************************************************************************
// Position reader/display task. This function reads the tape roller
// quadrature encoder and stores the current position data. The 7-segement
// tape position display is also updated via the task so the current tape
// position is always being shown on the machine's display on the transport.
//*****************************************************************************

typedef enum SearchState {
    SEARCH_START_STATE,
    SEARCH_BEGIN_SHUTTLE,
    SEARCH_SHUTTLE_FAR,
    SEARCH_SHUTTLE_MID,
    SEARCH_SHUTTLE_NEAR,
    SEARCH_BRAKE_STATE,
    SEARCH_BRAKE_VELOCITY,
    SEARCH_PAST_ZERO,
    SEARCH_ZERO_DIR,
    SEARCH_ZERO_CROSS,
    SEARCH_COMPLETE,
} SearchState;

Void LocateTaskFxn(UArg arg0, UArg arg1)
{
    bool     cancel;
    int32_t  dir;
    int32_t  cue_from;
	int32_t  cue_dist;
	int32_t  abs_dist;
    size_t   cue_index;
	uint32_t shuttle_vel;
    uint32_t key;
    LocateMessage msg;

    CLI_printf("\n\nSTC-1200 Starting...\n\n");

    /* Get current transport mode from DTC */
    Transport_GetMode(&g_sysData.transportMode);

    /* Clear SEARCHING_OUT status i/o pin */
    GPIO_write(Board_SEARCHING, PIN_HIGH);

    /* Initialize single transport cue point to zero */
    CuePointSet(LAST_CUE_POINT, 0);

    /* Initialize LOC-1 to zero */
    CuePointSet(g_sysData.currentCueIndex, 0);

    while(TRUE)
    {
        /* Wait for a locate request */
        Mailbox_pend(g_mailboxLocate, &msg, BIOS_WAIT_FOREVER);

        /* Only look for locate requests initially */
        if (msg.command != LOCATE_SEARCH)
        	continue;

        /* Discard locate request if in halt mode */
        if (IsTransportHaltMode())
            continue;

        /* Get the cue point memory index. The cue point table is arranged
         * with 64 memory positions from 0-63. Memory location 64 is reserved
         * for the single point cue/search buttons on the machine timer/roller.
         */
        cue_index = (size_t)msg.param1;

        if (cue_index > MAX_CUE_POINTS)
        	continue;

        /* Is the cue point is active? */
        if (g_sysData.cuePoint[cue_index].flags == 0)
        	continue;

        /* Clear the global search cancel flag */
        key = Hwi_disable();
        g_sysData.searching = TRUE;
        g_sysData.searchCancel = FALSE;
        g_sysData.searchProgress = 0;
        Hwi_restore(key);

        /* Set SEARCHING_OUT status i/o pin */
        GPIO_write(Board_SEARCHING, PIN_LOW);

        /* Cue memory is active, turn on the button LED */
        SetLocateButtonLED(cue_index);

        /* Set transport to STOP mode initially */
        Transport_Stop();

        /* Save cue from distance */
        cue_from = g_sysData.cuePoint[cue_index].ipos - g_sysData.tapePosition;

        if (!cue_from)
            cue_from = 1;

        SearchState state = SEARCH_START_STATE;

        cancel = FALSE;

        /**************************************/
        /* BEGIN MAIN AUTO-LOCATE SEARCH LOOP */
        /**************************************/

	    while (!cancel)
	    {
	        float time;
            float velocity;

            /* Abort if transport halted, must be tape out? */
            if (IsTransportHaltMode())
                break;

			/* Get the signed absolute position(distance) cue_from the cue point */
            cue_dist = g_sysData.cuePoint[cue_index].ipos - g_sysData.tapePosition;

            abs_dist = abs(cue_dist);

			/* v = d/t */
			if ((velocity = g_sysData.tapeTach) < 1.0f)
			    velocity = 1.0f;

			/* d = v * t */
			/* t = d/v */
			time = (float)abs_dist / velocity;

			/* Calculate the search progress as percentage */

            float progress = fabs(((float)cue_dist / cue_from) * 100.0f);

            if (progress > 100.0f)
                progress = 100.0f;

            g_sysData.searchProgress = (int32_t)progress;

            //if (state >= SEARCH_SHUTTLE_FAR)
            //    CLI_printf("d=%d, t=%u, v=%u\n", cue_dist, (uint32_t)time, (uint32_t)velocity);

