rtzaudio/STC1200_TivaTM4C1294NCPDT/LocateTask.c
			/*
			 * SEARCH FINITE STATE MACHINE
			 */

			switch(state)
			{
			case SEARCH_START_STATE:

			    /* Determine which direction we need to go initially */

			    CLI_printf("\nBEGIN LOCATE[%u] ", cue_index);

			    if (g_sysData.cuePoint[cue_index].ipos > g_sysData.tapePosition)
		        {
                    CLI_printf("> ");
		            dir = DIR_FWD;
		        }
		        else if (g_sysData.cuePoint[cue_index].ipos < g_sysData.tapePosition)
		        {
                    CLI_printf("< ");
		            dir = DIR_REW;
		        }
		        else
		        {
                    CLI_printf("AT ZERO!!\n");
                    cancel = TRUE;
		            dir = DIR_ZERO;
		            break;
		        }

			    state = SEARCH_BEGIN_SHUTTLE;
		        break;

			case SEARCH_BEGIN_SHUTTLE:

			    /* Determine the shuttle speed range based on distance out */

			    if (abs_dist > 8000)
                {
                    CLI_printf("FAR");
                    shuttle_vel = 500;
                    state = SEARCH_SHUTTLE_FAR;
                }
                else if (abs_dist > 2000)
                {
                    CLI_printf("MID");
                    shuttle_vel = 300;
                    state = SEARCH_SHUTTLE_MID;
                }
                else
                {
                    CLI_printf("NEAR");
                    shuttle_vel = 100;
                    state = SEARCH_SHUTTLE_NEAR;
                }

                CLI_printf(" d=%d, t=%d\n", cue_dist, (int32_t)time);

                /* Start the transport in either FWD or REV direction
		         * based on the cue point and current location.
		         */
                if (dir == DIR_FWD)
		            Transport_Fwd(shuttle_vel);
		        else
		            Transport_Rew(shuttle_vel);
			    break;

            case SEARCH_SHUTTLE_FAR:

                if (time < 130.0f)
			    {
                    state = SEARCH_BRAKE_VELOCITY;

	                if (velocity > 40.0f)
	                {
                        CLI_printf("SHUTTLE FAR BRAKE STATE d=%d\n", cue_dist);

	                    state = SEARCH_BRAKE_STATE;
	                }
			    }
			    break;

            case SEARCH_SHUTTLE_MID:

                if (time < 70.0f)
                {
                    state = SEARCH_BRAKE_VELOCITY;

                    if (velocity > 40.0f)
                    {
                        CLI_printf("SHUTTLE MID BRAKE STATE d=%d\n", cue_dist);

                        state = SEARCH_BRAKE_STATE;
                    }
                }
                break;

            case SEARCH_SHUTTLE_NEAR:

                if (time < 30.0f)
                {
                    CLI_printf("SHUTTLE NEAR STATE d=%d\n", cue_dist);

                    state = SEARCH_BRAKE_VELOCITY;
                }
                break;

            case SEARCH_BRAKE_STATE:

                CLI_printf("CHECK BRAKE STATE: d=%d, t=%d, v=%u\n", abs_dist, (int32_t)time, (uint32_t)velocity);

                if (velocity > 30.0f)
                {
                    CLI_printf("BEGIN DYNAMIC BRAKE: v=%u\n", (uint32_t)velocity);

                    Transport_Stop();

                    state = SEARCH_BRAKE_VELOCITY;
                }
                else
                {
                    CLI_printf("BEGIN COAST BRAKE: v=%u\n", (uint32_t)velocity);

                    /* Begin low speed shuttle */
                    if (dir == DIR_FWD)
                        Transport_Fwd(130);
                    else
                        Transport_Rew(130);

                    state = SEARCH_ZERO_CROSS;
                }

                /* Fall through to next velocity check state */

			case SEARCH_BRAKE_VELOCITY:

			    /* Wait for velocity to drop to 15 or below */

			    if (time < 20.0f)
			        break;

			    CLI_printf("BEGIN SLOW SHUTTLE d=%d, t=%d, v=%u\n", cue_dist, (int32_t)time, (uint32_t)velocity);

                /* Begin low speed shuttle */
                if (dir == DIR_FWD)
                    Transport_Fwd(130);
                else
                    Transport_Rew(130);

                /* Next look for zero cross */
                state = SEARCH_ZERO_CROSS;

                /* Fall through... */

            case SEARCH_ZERO_CROSS:

                /* ZERO CROSS - check taking direction into account */

                if (abs_dist <= 10)
                {
                    //g_sysData.searchProgress = 100;
                    cancel = TRUE;
                    Transport_Stop();
                    CLI_printf("ZERO CROSSED %d\n", cue_dist);
                }
                break;

            default:
			    /* invalid state! */
			    cancel = TRUE;
			    break;
			}

			/* Check for a new locate command. It's possible the user may have requested
			 * a new locate cue point while a locate command was already in progress.
			 * If so, we cancel the current locate request and reset to start searching
			 * at the new cue point requested.
			 */

			if (cancel)
                break;

	        if (Mailbox_pend(g_mailboxLocate, &msg, 5))
	        {
	            /* Abort search loop if cancel requested */
                if (msg.command == LOCATE_CANCEL)
                {
                    cancel = TRUE;
                    break;
                }
                else if (msg.command == LOCATE_SEARCH)
	            {
                    /* New search requested! */

                    cue_index = (size_t)msg.param1;

                    if (cue_index > MAX_CUE_POINTS)
                        break;

                    /* Is the cue point is active? */
                    if (g_sysData.cuePoint[cue_index].flags == 0)
                        break;

                    /* Clear the global search cancel flag */
                    key = Hwi_disable();
                    g_sysData.searching = TRUE;
                    g_sysData.searchCancel = FALSE;
                    g_sysData.searchProgress = 0;
                    Hwi_restore(key);

                    /* Set SEARCHING_OUT status i/o pin */
                    GPIO_write(Board_SEARCHING, PIN_LOW);

