rtzaudio/STC1200_TivaTM4C1294NCPDT/LocateTask.c
                    /* Cue memory is active, turn on the button LED */
                    SetLocateButtonLED(cue_index);

                    /* Set transport to STOP mode initially */
                    Transport_Stop();

                    /* Save cue from distance */
                    cue_from = g_sysData.cuePoint[cue_index].ipos - g_sysData.tapePosition;

                    if (!cue_from)
                        cue_from = 1;

                    state = SEARCH_START_STATE;
	            }
	        }

	        /* Abort if transport halted, must be tape out? */
            if (IsTransportHaltMode())
                break;

	        /* Exit if user search cancel */
            if (g_sysData.searchCancel)
                break;
	    }

	    /* Send STOP button pulse to stop transport */
	    if (!g_sysData.searchCancel)
	        Transport_Stop();

	    /* Set SEARCHING_OUT status i/o pin */
	    GPIO_write(Board_SEARCHING, PIN_HIGH);

	    /* Clear the search in progress flag */
	    key = Hwi_disable();
	    g_sysData.searching = FALSE;
	    g_sysData.searchCancel = FALSE;
	    Hwi_restore(key);

        CLI_printf("SEARCH END\n");
    }
}

#if 0
            case SEARCH_PAST_ZERO:

                /* ZERO CROSS - check taking direction into account */

                if (dir == DIR_FWD)
                {
                    if (cue_dist < 300)
                    {
                        CLI_printf("PASSED ZERO BY d=%d - CHANGE DIR\n", cue_dist);
                        last_dir = g_sysData.tapeDirection;
                        /* FORWARD overshoot, change direction */
                        Transport_Rew(250);
                        state = SEARCH_ZERO_DIR;
                    }
                }
                else
                {
                    if (cue_dist > 300)
                    {
                        CLI_printf("PASSED ZERO BY d=%d - CHANGE DIR\n", cue_dist);
                        last_dir = g_sysData.tapeDirection;
                        /* REWIND overshoot, change direction */
                        Transport_Fwd(250);
                        state = SEARCH_ZERO_DIR;
                    }
                }
                break;

            case SEARCH_ZERO_DIR:

                /* Wait for tape direction to change */
                if (g_sysData.tapeDirection != last_dir)
                {
                    CLI_printf("DIRECTION CHANGE EVENT\n");
                    state = SEARCH_ZERO_CROSS;
                }
                break;
#endif

/*****************************************************************************
 * HELPER FUNCTIONS
 *****************************************************************************/

//*****************************************************************************
// Pulse and I/O line LOW for the specified ms duration. The following
// gpio lines are used to control the transport directly. Index should
// be one of the following for the transport control buttons:
//
//   Board_STOP_N
//   Board_PLAY_N
//   Board_FWD_N
//   Board_REW_N
//
//*****************************************************************************

#if 0
void GPIOPulseLow(uint32_t index, uint32_t duration)
{
    /* Set the i/o pin to low state */
    GPIO_write(index, PIN_LOW);
    /* Sleep for pulse duration */
    Task_sleep(duration);
    /* Return i/o pin to high state */
    GPIO_write(index, PIN_HIGH);
}
#endif

/*****************************************************************************
 * DTC-1200 TRANSPORT COMMANDS
 *****************************************************************************/

//#define OP_MODE_FWD_LIB             303
//#define OP_MODE_REW_LIB             305

Bool Transport_Stop(void)
{
    IPCMSG msg;

    msg.type     = IPC_TYPE_TRANSPORT;
    msg.opcode   = OP_MODE_STOP;
    msg.param1.U = 0;
    msg.param2.U = 0;

    return IPC_Notify(&msg, IPC_TIMEOUT);
}

Bool Transport_Play(void)
{
    IPCMSG msg;

    msg.type     = IPC_TYPE_TRANSPORT;
    msg.opcode   = OP_MODE_PLAY;
    msg.param1.U = 0;
    msg.param2.U = 0;

    return IPC_Notify(&msg, IPC_TIMEOUT);
}

Bool Transport_Fwd(uint32_t velocity)
{
    IPCMSG msg;

    msg.type     = IPC_TYPE_TRANSPORT;
    msg.opcode   = OP_MODE_FWD;
    msg.param1.U = velocity;
    msg.param2.U = 0;

    return IPC_Notify(&msg, IPC_TIMEOUT);
}

Bool Transport_Rew(uint32_t velocity)
{
    IPCMSG msg;

    msg.type     = IPC_TYPE_TRANSPORT;
    msg.opcode   = OP_MODE_REW;
    msg.param1.U = velocity;
    msg.param2.U = 0;

    return IPC_Notify(&msg, IPC_TIMEOUT);
}

/*****************************************************************************
 * DTC-1200 TRANSPORT TRANSACTIONS
 *****************************************************************************/

Bool Transport_GetMode(uint32_t* mode)
{
    IPCMSG msg;

    msg.type     = IPC_TYPE_TRANSPORT;
    msg.opcode   = OP_TRANSPORT_GET_MODE;
    msg.param1.U = 0;
    msg.param2.U = 0;

    if (!IPC_Transaction(&msg, IPC_TIMEOUT))
        return FALSE;

    /* return current transport mode */
    *mode = msg.param1.U;

    return TRUE;
}

/*****************************************************************************
 * DTC-1200 CONFIGURATION PARAMETERS
 *****************************************************************************/

Bool Config_SetShuttleVelocity(uint32_t velocity)
{
    IPCMSG msg;

    msg.type     = IPC_TYPE_CONFIG;
    msg.opcode   = OP_SET_SHUTTLE_VELOCITY;
    msg.param1.U = velocity;
    msg.param2.U = 0;

    return IPC_Transaction(&msg, IPC_TIMEOUT);
}

Bool Config_GetShuttleVelocity(uint32_t* velocity)
{
    IPCMSG msg;

    msg.type     = IPC_TYPE_CONFIG;
    msg.opcode   = OP_GET_SHUTTLE_VELOCITY;
    msg.param1.U = 0;
    msg.param2.U = 0;

    if (!IPC_Transaction(&msg, IPC_TIMEOUT))
        return FALSE;

    /* Return query results */
    *velocity = msg.param1.U;

    return TRUE;
}

/* End-Of-File */
